src/cf/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкДляРасчётов</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСуммуБезКопеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчёта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСчёта</name>
    <type>
      <types>EnumRef.ТипыБанковскихСчетов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	БИК = ТекущийОбъект.Банк.Код;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИспользуетсяБанкДляРасчётов = ЗначениеЗаполнено(Объект.БанкДляРасчётов);
	УстановитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = СокрЛП(Объект.Банк) + " (" + СокрЛП(Объект.НомерСчёта) + ")";
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоБИК(Команда)
	ЗаполнитьПоБИКНаСервере();
	Если Не ЗначениеЗаполнено(Объект.Банк) Тогда
		Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораБанка", ЭтотОбъект);
		ОткрытьФорму("Справочник.Банки.ФормаВыбора",, ЭтаФорма,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяБанкДляРасчетовПриИзменении(Элемент)
	УстановитьДоступностьРеквизитов();
	Если Не ИспользуетсяБанкДляРасчётов Тогда
		Объект.БанкДляРасчётов = Неопределено;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	ЗаполнитьПоБИК(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораБанка(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Объект.Банк = РезультатЗакрытия;
	БИК = БИКБанка();
КонецПроцедуры	

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	Элементы.БанкДляРасчётов.Доступность = ИспользуетсяБанкДляРасчётов;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоБИКНаСервере()
	Объект.Банк = Справочники.Банки.ПолучитьПоБИК(БИК);
КонецПроцедуры

&НаСервере
Функция БИКБанка()
	Возврат Объект.Банк.Код;	
КонецФункции	

#КонецОбласти
